Конфигурация/src/Documents/ПриходДенег/ПриходДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходДенег</name>
  <registerRecords>AccumulationRegister.ОстаткиДенег</registerRecords>
  <registerRecords>AccumulationRegister.ОборотыДенег</registerRecords>
  <attributes>
    <name>Кошелек</name>
    <type>
      <types>CatalogRef.Кошельки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>СтатьяДвижения</name>
      <type>
        <types>CatalogRef.ДвиженияДенег</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/Documents/ПриходДенег/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура заполняет табличный документ для печати.
//
// Параметры:
//	ТабДок - ТабличныйДокумент - табличный документ для заполнения и печати.
//	Ссылка - Произвольный - содержит ссылку на объект, для которого вызвана команда печати.
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = ПолучитьМакет("Печать");
	ТабДок.Очистить();
	
	Выборка = ВернутьВыборку(Ссылка);
	
	Если Выборка.Следующий() Тогда
			
		// Заголовок
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ПараметрыОбластиЗаголовка = Новый Структура;
		ПараметрыОбластиЗаголовка.Вставить("Номер", Выборка.Номер);
		ПараметрыОбластиЗаголовка.Вставить("Дата", Формат(Выборка.Дата, "ДЛФ=D;"));
		ОбластьЗаголовок.Параметры.Заполнить(ПараметрыОбластиЗаголовка);
		ТабДок.Вывести(ОбластьЗаголовок);
		
		// Реквизиты
		ОбластьРеквизиты = Макет.ПолучитьОбласть("Шапка");
		ПараметрыОбластиРеквизиты = Новый Структура;
		ПараметрыОбластиРеквизиты.Вставить("Кошелек", Выборка.Кошелек);
		ОбластьРеквизиты.Параметры.Заполнить(ПараметрыОбластиРеквизиты);
		ТабДок.Вывести(ОбластьРеквизиты);
		
		// Шапка таблицы
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ТабличнаяЧастьШапка");
		ТабДок.Вывести(ОбластьШапкаТаблицы);
		
		// Таблица
		ОбластьСтрока = Макет.ПолучитьОбласть("ТабличнаяЧасть");
		ВыборкаТЧ = Выборка.ТабличнаяЧасть.Выгрузить();
		Для Каждого ТекСтрока Из ВыборкаТЧ Цикл
			
			ОбластьСтрока.Параметры.Заполнить(ТекСтрока);
			ТабДок.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		// Подвал
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		ПараметрыОбластиПодвала = Новый Структура;
		Итого = ВыборкаТЧ.Итог("Сумма");
		СуммаПрописью = ЧислоПрописью(Итого, "L=ru_RU", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
		ПараметрыОбластиПодвала.Вставить("Итого", Формат(Итого, "ЧДЦ=2; ЧГ=0"));
		ПараметрыОбластиПодвала.Вставить("СуммаПрописью", СуммаПрописью);
		ПараметрыОбластиПодвала.Вставить("Номер", Выборка.Номер);
		ПараметрыОбластиПодвала.Вставить("Дата", Формат(Выборка.Дата, "ДЛФ=D;"));
		ОбластьПодвал.Параметры.Заполнить(ПараметрыОбластиПодвала);
		ТабДок.Вывести(ОбластьПодвал);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//#Область ОбработчикиСобытий
//
//#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Вернуть выборку.
// 
// Параметры:
//  Ссылка - Произвольный - Ссылка
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Вернуть выборку:
//		*Номер - Строка
//		*Дата - Дата
//		*Кошелек - СправочникСсылка.Кошельки
//		*ТабличнаяЧасть - ДокументТабличнаяЧасть.ПриходДенег.ТабличнаяЧасть:
//			*НомерСтроки - Число
//			*СтатьяДвижения - СправочникСсылка.ДвиженияДенег
//			*Сумма - Число
Функция ВернутьВыборку(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриходДенег.Номер КАК Номер,
		|	ПриходДенег.Дата КАК Дата,
		|	ПриходДенег.Кошелек КАК Кошелек,
		|	ПриходДенег.ТабличнаяЧасть.(
		|		НомерСтроки КАК НомерСтроки,
		|		СтатьяДвижения КАК СтатьяДвижения,
		|		Сумма КАК Сумма) КАК ТабличнаяЧасть
		|ИЗ
		|	Документ.ПриходДенег КАК ПриходДенег
		|ГДЕ
		|	ПриходДенег.Ссылка В (&Ссылка)";
		
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
